project/app/views/orders/_form.html.erb

      <ul>
        <% current_cart.items.each do |item| %>
---
SELECT "items".* FROM "items" WHERE "items"."cart_id" = ?  [["cart_id", 3]]