project/app/views/orders/_order.html.erb

SELECT "orders".* FROM "orders"
---
      <strong>下单时间:</strong>
      <%= order.order_time %>

SELECT "items".* FROM "items" WHERE "items"."order_id" = ?  [["order_id", 1]]
---
      <ul>
        <% order.items.each do |item| %>