project/app/views/orders/index.html.erb

SELECT "orders".* FROM "orders"
---
        <div class="time">
          <%= order.order_time %>