project/app/controllers/application_controller.rb

        def current_cart
            Cart.find(session[:cart_id])
        rescue ActiveRecord::RecordNotFound
            cart = Cart.create
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2023-01-01 14:12:15.774432"], ["updated_at", "2023-01-01 14:12:15.774432"]]