project/app/controllers/application_controller.rb

        def current_cart
            if current_user.cart.nil?
                cart = Cart.create
---
INSERT INTO "carts" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?)  [["created_at", "2023-01-04 08:58:52.543165"], ["updated_at", "2023-01-04 08:58:52.543165"], ["user_id", 2]]

        def current_starfold
            if current_user.starfold.nil?
                starfold = Starfold.create
---
INSERT INTO "starfolds" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?)  [["created_at", "2023-01-04 11:16:48.177817"], ["updated_at", "2023-01-04 11:16:48.177817"], ["user_id", 1]]