project/app/controllers/carts_controller.rb

  def index
    @carts = Cart.all
---
SELECT "carts".* FROM "carts"

  def destroy
    @cart = current_cart
    @cart.destroy
---
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 3]]

    def set_cart
      @cart = Cart.find(params[:id])
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]