project/app/controllers/items_controller.rb

SELECT "items".* FROM "items"
---
  def index
    @items = Item.all

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?)  [["created_at", "2023-01-02 15:26:30.886315"], ["updated_at", "2023-01-02 15:26:30.886315"], ["user_id", 2]]
INSERT INTO "items" ("product_id", "cart_id", "created_at", "updated_at", "quantity", "order_id") VALUES (?, ?, ?, ?, ?, ?)  [["product_id", 1], ["cart_id", 3], ["created_at", "2023-01-04 08:58:49.003230"], ["updated_at", "2023-01-04 08:58:49.003230"], ["quantity", 1], ["order_id", nil]]
UPDATE "items" SET "updated_at" = ?, "quantity" = ? WHERE "items"."id" = ?  [["updated_at", "2023-01-04 08:59:28.232891"], ["quantity", 2], ["id", 16]]
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @item = @cart.add_product(product.id)

    respond_to do |format|
      if @item.save