project/app/controllers/orders_controller.rb

  def index
    # @orders = Order.all
    @orders = Order.paginate :page=>params[:page], :per_page => 2
---
SELECT "orders".* FROM "orders" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "orders"

  def create
    @order = Order.new(order_params)
    @order.add_items_from_cart(current_cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
---
INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "dasd"], ["address", "sadsdada"], ["email", "mingyu_zheng@126.com"], ["pay_type", "支付宝"], ["created_at", "2023-01-02 09:21:58.450637"], ["updated_at", "2023-01-02 09:21:58.450637"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 6]]

    def set_order
      @order = Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]