project/app/controllers/orders_controller.rb

  def index
    if user_admin?
      @orders = Order.all
    else
      @orders = Order.all.where(:user => current_user)
---
SELECT "orders".* FROM "orders"
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 2]]

  def new
    @cart = current_cart
    if @cart.items.empty?
---
SELECT "items".* FROM "items" WHERE "items"."cart_id" = ?  [["cart_id", 5]]
SELECT 1 AS one FROM "items" WHERE "items"."cart_id" = ? LIMIT ?  [["cart_id", 5], ["LIMIT", 1]]

  def create
    @order = Order.new(order_params)
    @order.add_items_from_cart(current_cart)
    @order.user = current_user
    @order.order_time = Time.now
    @order.total_price = current_cart.total_price
    @order.order_status = Order::ORDER_STATUSES[0]

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
---
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."cart_id" = ?  [["cart_id", 5]]
INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at", "user_id", "order_time", "total_price", "order_status") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 5]]

  def update
    respond_to do |format|
      if @order.update(order_params)
---
UPDATE "orders" SET "updated_at" = ?, "order_status" = ? WHERE "orders"."id" = ?  [["updated_at", "2023-01-04 08:02:23.456357"], ["order_status", "待收货"], ["id", 1]]

  def destroy
    @order.destroy
---
DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 3]]

    def set_order
      @order = Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]