project/app/controllers/products_controller.rb

INSERT INTO "products" ("title", "description", "image_url", "price", "created_at", "updated_at", "type") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["price", 8.0], ["updated_at", "2023-01-02 04:35:00.764264"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)

DELETE FROM "products" WHERE "products"."id" = ?  [["id", 1]]
---
  def destroy
    @product.destroy

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_product
      @product = Product.find(params[:id])