project/app/controllers/sitems_controller.rb

SELECT "sitems".* FROM "sitems"
---
  def index
    @sitems = Sitem.all

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "sitems" ("product_id", "starfold_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 1], ["starfold_id", 1], ["created_at", "2023-01-04 09:08:15.350123"], ["updated_at", "2023-01-04 09:08:15.350123"]]
---
  def create
    @starfold = current_starfold
    product = Product.find(params[:product_id])
    # @item = @cart.add_product(product.id)
    @sitem = @starfold.add_product(product.id)

    respond_to do |format|
      if @sitem.save

DELETE FROM "sitems" WHERE "sitems"."id" = ?  [["id", 3]]
---
  def destroy
    @sitem.destroy

SELECT "sitems".* FROM "sitems" WHERE "sitems"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_sitem
      @sitem = Sitem.find(params[:id])