project/app/controllers/starfolds_controller.rb

SELECT "starfolds".* FROM "starfolds" WHERE "starfolds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_starfold
      @starfold = Starfold.find(params[:id])