blog4/app/views/users/show.html.erb

  <p>
    <% @user.blogs.each do |blog| %>
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."user_id" = ?  [["user_id", 1]]