project/app/models/order.rb

SELECT "items".* FROM "items" WHERE "items"."cart_id" = ?  [["cart_id", 1]]
---
    def add_items_from_cart(cart)
        cart.items.each do |item|