project/app/models/user.rb

SELECT COUNT(*) FROM "users"
---
      def ensure_has_a_admin
        if User.count == 0