blog4/app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "你好"], ["content", "121212"], ["created_at", "2022-12-31 04:36:37.318320"], ["updated_at", "2022-12-31 04:36:37.318320"], ["user_id", 2]]
---
  def create
    @blog = Blog.new(blog_params)
    @blog.user = current_user

    respond_to do |format|
      if @blog.save