blog4/app/controllers/comments_controller.rb

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("blog_id", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["blog_id", 3], ["content", "hhhh"], ["created_at", "2022-12-31 05:18:46.181403"], ["updated_at", "2022-12-31 05:18:46.181403"], ["user_id", 3]]
---
  def create
    @blog = Blog.find(params[:blog_id])
    @comment = Comment.new(comment_params)
    @comment.blog = @blog
    @comment.user = current_user

    respond_to do |format|
      if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" = ?  [["blog_id", 2]]
---
    def set_comment
      @comment = Comment.find(params[:id])